interface shortTermData {
  createTime: Date,
  // ======= 短线数据 =======
  // 涨停数量
  dailyLimitQuantity: Number,
  // 跌停数量
  downLimitQuantity: Number,
  // 最高连板，市场高度
  marketHeight: Number,
  // 一板数量
  board1: Number,
  board2: Number,
  board3: Number,
  board4: Number,
  board5: Number,
  board6: Number,
  board7: Number,
  board8: Number,
  board9: Number,
  // 大盘点数

  // ======= 资金流向 =======

  // ======= 龙虎榜 =======
}

const mockData = [
  {
    '上市交易日天数[20230420]': '6511',
    'a股市值(不含限售股)[20230420]': '4788658000.000',
    code: '000404',
    '股票简称': '长虹华意',
    '最新价': '6.89',
    '最新涨跌幅': '10.064',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '000404.SZ'
  },
  {
    '上市交易日天数[20230420]': '6361',
    'a股市值(不含限售股)[20230420]': '10808901400.000',
    code: '000681',
    '股票简称': '视觉中国',
    '最新价': '18.50',
    '最新涨跌幅': '9.988',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '000681.SZ'
  },
  {
    '上市交易日天数[20230420]': '6322',
    'a股市值(不含限售股)[20230420]': '8199243300.000',
    code: '000719',
    '股票简称': '中原传媒',
    '最新价': '12.29',
    '最新涨跌幅': '10.027',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '000719.SZ'
  },
  {
    '上市交易日天数[20230420]': '5549',
    'a股市值(不含限售股)[20230420]': '35063950000.000',
    code: '000988',
    '股票简称': '华工科技',
    '最新价': '34.89',
    '最新涨跌幅': '9.994',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '000988.SZ'
  },
  {
    '上市交易日天数[20230420]': '34',
    'a股市值(不含限售股)[20230420]': '2348400000.000',
    code: '001337',
    '股票简称': '四川黄金',
    '最新价': '39.14',
    '最新涨跌幅': '10.006',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '001337.SZ'
  },
  {
    '上市交易日天数[20230420]': '3671',
    'a股市值(不含限售股)[20230420]': '14512703000.000',
    code: '002222',
    '股票简称': '福晶科技',
    '最新价': '34.10',
    '最新涨跌幅': '10.000',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '002222.SZ'
  },
  {
    '上市交易日天数[20230420]': '3207',
    'a股市值(不含限售股)[20230420]': '10039829400.000',
    code: '002351',
    '股票简称': '漫步者',
    '最新价': '20.41',
    '最新涨跌幅': '10.027',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '002351.SZ'
  },
  {
    '上市交易日天数[20230420]': '3079',
    'a股市值(不含限售股)[20230420]': '49639042000.000',
    code: '002463',
    '股票简称': '沪电股份',
    '最新价': '26.07',
    '最新涨跌幅': '10.000',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '002463.SZ'
  },
  {
    '上市交易日天数[20230420]': '2791',
    'a股市值(不含限售股)[20230420]': '38374579000.000',
    code: '002624',
    '股票简称': '完美世界',
    '最新价': '21.00',
    '最新涨跌幅': '10.005',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '002624.SZ'
  },
  {
    '上市交易日天数[20230420]': '1338',
    'a股市值(不含限售股)[20230420]': '4883056600.000',
    code: '002908',
    '股票简称': '德生科技',
    '最新价': '22.83',
    '最新涨跌幅': '10.024',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '002908.SZ'
  },
  {
    '上市交易日天数[20230420]': '1112',
    'a股市值(不含限售股)[20230420]': '72615429000.000',
    code: '002938',
    '股票简称': '鹏鼎控股',
    '最新价': '31.90',
    '最新涨跌幅': '10.000',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '002938.SZ'
  },
  {
    '上市交易日天数[20230420]': '724',
    'a股市值(不含限售股)[20230420]': '1202552920.000',
    code: '002983',
    '股票简称': '芯瑞达',
    '最新价': '23.31',
    '最新涨跌幅': '10.005',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '002983.SZ'
  },
  {
    '上市交易日天数[20230420]': '3197',
    'a股市值(不含限售股)[20230420]': '24210893000.000',
    code: '300058',
    '股票简称': '蓝色光标',
    '最新价': '10.44',
    '最新涨跌幅': '20.000',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '300058.SZ'
  },
  {
    '上市交易日天数[20230420]': '1275',
    'a股市值(不含限售股)[20230420]': '12445120100.000',
    code: '300624',
    '股票简称': '万兴科技',
    '最新价': '108.05',
    '最新涨跌幅': '20.002',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '300624.SZ'
  },
  {
    '上市交易日天数[20230420]': '1290',
    'a股市值(不含限售股)[20230420]': '4156018500.000',
    code: '300684',
    '股票简称': '中石科技',
    '最新价': '22.84',
    '最新涨跌幅': '20.021',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '300684.SZ'
  },
  {
    '上市交易日天数[20230420]': '668',
    'a股市值(不含限售股)[20230420]': '3830161200.000',
    code: '300856',
    '股票简称': '科思股份',
    '最新价': '64.94',
    '最新涨跌幅': '19.993',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '300856.SZ'
  },
  {
    '上市交易日天数[20230420]': '146',
    'a股市值(不含限售股)[20230420]': '2211774800.000',
    code: '301205',
    '股票简称': '联特科技',
    '最新价': '122.74',
    '最新涨跌幅': '20.004',
    '连续涨停天数[20230420]': 1,
    market_code: '33',
    '股票代码': '301205.SZ'
  },
  {
    '上市交易日天数[20230420]': '6260',
    'a股市值(不含限售股)[20230420]': '26615813000.000',
    code: '600100',
    '股票简称': '同方股份',
    '最新价': '8.98',
    '最新涨跌幅': '10.049',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '600100.SH'
  },
  {
    '上市交易日天数[20230420]': '7357',
    'a股市值(不含限售股)[20230420]': '6461467200.000',
    code: '600629',
    '股票简称': '华建集团',
    '最新价': '6.84',
    '最新涨跌幅': '9.968',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '600629.SH'
  },
  {
    '上市交易日天数[20230420]': '7049',
    'a股市值(不含限售股)[20230420]': '2566125200.000',
    code: '600854',
    '股票简称': '春兰股份',
    '最新价': '4.94',
    '最新涨跌幅': '10.022',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '600854.SH'
  },
  {
    '上市交易日天数[20230420]': '1183',
    'a股市值(不含限售股)[20230420]': '376177150000.000',
    code: '601138',
    '股票简称': '工业富联',
    '最新价': '19.00',
    '最新涨跌幅': '10.017',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '601138.SH'
  },
  {
    '上市交易日天数[20230420]': '1520',
    'a股市值(不含限售股)[20230420]': '24062820000.000',
    code: '601858',
    '股票简称': '中国科传',
    '最新价': '30.44',
    '最新涨跌幅': '10.011',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '601858.SH'
  },
  {
    '上市交易日天数[20230420]': '1377',
    'a股市值(不含限售股)[20230420]': '14106150000.000',
    code: '601949',
    '股票简称': '中国出版',
    '最新价': '7.74',
    '最新涨跌幅': '9.943',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '601949.SH'
  },
  {
    '上市交易日天数[20230420]': '2059',
    'a股市值(不含限售股)[20230420]': '79369382000.000',
    code: '603019',
    '股票简称': '中科曙光',
    '最新价': '54.71',
    '最新涨跌幅': '9.992',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '603019.SH'
  },
  {
    '上市交易日天数[20230420]': '1354',
    'a股市值(不含限售股)[20230420]': '11130423700.000',
    code: '603533',
    '股票简称': '掌阅科技',
    '最新价': '25.36',
    '最新涨跌幅': '10.022',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '603533.SH'
  },
  {
    '上市交易日天数[20230420]': '483',
    'a股市值(不含限售股)[20230420]': '1474269300.000',
    code: '605289',
    '股票简称': '罗曼股份',
    '最新价': '29.13',
    '最新涨跌幅': '10.008',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '605289.SH'
  },
  {
    '上市交易日天数[20230420]': '670',
    'a股市值(不含限售股)[20230420]': '64460131000.000',
    code: '688256',
    '股票简称': '寒武纪',
    '最新价': '266.16',
    '最新涨跌幅': '20.000',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '688256.SH'
  },
  {
    '上市交易日天数[20230420]': '137',
    'a股市值(不含限售股)[20230420]': '4028011200.000',
    code: '688387',
    '股票简称': '信科移动',
    '最新价': '8.33',
    '最新涨跌幅': '20.029',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '688387.SH'
  },
  {
    '上市交易日天数[20230420]': '73',
    'a股市值(不含限售股)[20230420]': '3368375100.000',
    code: '688525',
    '股票简称': '佰维存储',
    '最新价': '96.83',
    '最新涨跌幅': '20.003',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '688525.SH'
  },
  {
    '上市交易日天数[20230420]': '640',
    'a股市值(不含限售股)[20230420]': '4526701100.000',
    code: '688569',
    '股票简称': '铁科轨道',
    '最新价': '34.38',
    '最新涨跌幅': '20.000',
    '连续涨停天数[20230420]': 1,
    market_code: '17',
    '股票代码': '688569.SH'
  }
]